Revit 2027 API
ParameterTypeId.SteelElemPatternIntermediateDistanceX Property
 "Intermediate distance on side 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemPatternIntermediateDistanceX { get; }
Public Shared ReadOnly Property SteelElemPatternIntermediateDistanceX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemPatternIntermediateDistanceX {
	ForgeTypeId^ get ();
}
static member SteelElemPatternIntermediateDistanceX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace